/*********************************************************************************************************
* 模块名称: App.c
* 摘    要: 
* 当前版本: 
* 作    者: 
* 完成日期: 
* 内    容:
* 注    意:                                                                   
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include<stdio.h>

#include "PackUnpack.h"
#include "DataType.h"
/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void PrintfDataAfterPack(u8* pData);
static void PrintfDataAfterUnpack(u8* pData, i16 packLen);

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: 
* 函数功能: 
* 输入参数: 
* 输出参数: 
* 返 回 值: 
* 创建日期: 
* 注    意: 
*********************************************************************************************************/
static void PrintfDataAfterPack(u8* pData) {
    static u8 s_iCnt = 1;
    i16 i;

    printf("Packet NO %d After packing: \n", s_iCnt);
    s_iCnt++;

    for(i = 0; i < 10; i++) {
        printf("pData[%d] = %x \n", i, pData[i]);
    }
}

/*********************************************************************************************************
* 函数名称:
* 函数功能:
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期:
* 注    意:
*********************************************************************************************************/
static void PrintfDataAfterUnpack(u8* pData, i16 packLen) {
    static u8 s_iCnt = 1;
    i16 i;

    printf("Data NO.%d after unpacking: \n", s_iCnt);
    s_iCnt++;

    for(i = 0; i < packLen; i++) {
        printf("pData[%d] = %x \n", i, pData[i]);
    }
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: 
* 函数功能: 
* 输入参数: 
* 输出参数: 
* 返 回 值: 
* 创建日期: 
* 注    意: 
*********************************************************************************************************/
int main(void) {
    u8 i = 0;
    u8 packGot;
    StructPackType ptDataBeforePack1;
    StructPackType ptDataBeforePack2;

    u8 arrDataBeforeUnpack[100] = {0x70, 0xa0, 0x82, 0x92, 0xb4, 0xd6, 0xf8, 0x90, 0x80, 0xb6,
                                   0x22, 0x41,
                                   0x71, 0xa0, 0x82, 0x91, 0xb3, 0xd5, 0xf7, 0x99, 0x80, 0xbc};
    StructPackType ptDataAfterUnpack;

    InitPackUnpack();

    //对第一个数据包进行打包
    ptDataBeforePack1.packModuleId = MODULE_WAVE1;
    ptDataBeforePack1.packSecondId = DAT_WAVE1_WDATA;
    ptDataBeforePack1.arrData[0] = 0x12;
    ptDataBeforePack1.arrData[1] = 0x34;
    ptDataBeforePack1.arrData[2] = 0x56;
    ptDataBeforePack1.arrData[3] = 0x78;
    ptDataBeforePack1.arrData[4] = 0x90;
    ptDataBeforePack1.arrData[5] = 0x00;

    if(1 == PackData(&ptDataBeforePack1)) {
        PrintfDataAfterPack((u8*)&ptDataBeforePack1);
    }

    //对第二个数据包进行打包
    ptDataBeforePack2.packModuleId = MODULE_WAVE2;
    ptDataBeforePack2.packSecondId = DAT_WAVE2_WDATA;
    ptDataBeforePack2.arrData[0] = 0x11;
    ptDataBeforePack2.arrData[1] = 0x33;
    ptDataBeforePack2.arrData[2] = 0x55;
    ptDataBeforePack2.arrData[3] = 0x77;
    ptDataBeforePack2.arrData[4] = 0x99;
    ptDataBeforePack2.arrData[5] = 0x00;

    if(1 == PackData(&ptDataBeforePack2)) {
        PrintfDataAfterPack((u8*)&ptDataBeforePack2);
    }

    //依次对数据进行解包
    for(i = 0; i < 100; i++) {
        packGot = UnPackData(arrDataBeforeUnpack[i]);
        if(packGot > 0) {
            ptDataAfterUnpack = GetUnPackRs1t();
            PrintfDataAfterUnpack((u8*)&ptDataAfterUnpack, 10);
        }
    }

    return 0;
}
