/*********************************************************************************************************
* 模块名称: 
* 摘    要: 
* 当前版本: 
* 作    者: 
* 完成日期:  
* 内    容:
* 注    意:                                                                   
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "PackUnpack.h"
/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
static StructPackType s_ptPack;
static u8 s_iPackLen;
static u8 s_iGotPackId;
static u8 s_iRestByteNum;

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void PackWithCheckSum(u8* pPack);
static u8 UnpackWithCheckSum(u8* pPack);

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: PackMithCheckSum
* 函数功能: 初始化三个 8 位无符号整数变量: i、dataHead 和 checkSum。
          将 checkSum 的初始值设置为 pPack 数组的第一个元素。
          将 dataHead 的初始值设置为 0。
          然后进入一个从 8 到 2 (包括 2) 的循环:
          在每次迭代中,它执行以下步骤:
          将 dataHead 左移 1 位。
          从 pPack + i 处的元素中提取最高位 (第 7 位),并将其追加到 dataHead 的最低位。
          将 pPack + i 处元素的最高位 (第 7 位) 设置为 1。
          将 pPack + i 处元素的值加到 checkSum 变量。
          将 pPack + 1 处的元素设置为 dataHead 的值,并将其最高位 (第 7 位) 设置为 1。
          将 pPack + 1 处元素的值加到 checkSum 变量。
          将 pPack + 9 处的元素设置为 checkSum 的值,并将其最高位 (第 7 位) 设置为 1。
* 输入参数: 
* 输出参数: 
* 返 回 值: 
* 创建日期: 
* 注    意:
*********************************************************************************************************/
static void PackWithCheckSum(u8* pPack) {
    u8 i;
    u8 dataHead;
    u8 checkSum;

    checkSum = *(pPack);
    dataHead = 0;

    for(i = 8; i > 1; i--) {
        dataHead <<= 1;

        dataHead |= (*(pPack + i) & 0x80) >> 7;

        *(pPack + i) = *(pPack + i) | 0x80;

        checkSum += *(pPack + i);
    }

    *(pPack + 1) = dataHead |0x80;

    checkSum += *(pPack + 1);

    *(pPack + 9) = checkSum | 0x80;
}

/*********************************************************************************************************
* 函数名称: UnpackWithCgeckSum
* 函数功能:
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期:
* 注    意:
*********************************************************************************************************/
static u8 UnpackWithCheckSum(u8* pPack) {
    u8 i;
    u8 dataHead;
    u8 checkSum;

    checkSum = *(pPack);

    dataHead = *(pPack + 1);
    checkSum += dataHead;

    for(i = 2; i < 9; i++) {
        checkSum += *(pPack + i);

        *(pPack + i) = (*(pPack + i) & 0x7f) | ((dataHead & 0x1) << 7);

        dataHead >>= 1;
    }

    if((checkSum & 0x7f) != ((*(pPack + 9)) & 0x7f)) {
        return 0;
    }

    return 1;
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: InitPackUnpack
* 函数功能:  
* 输入参数: 
* 输出参数: 
* 返 回 值: 
* 创建日期: 
* 注    意:
*********************************************************************************************************/
void InitPackUnpack(void) {
    i16 i;

    s_ptPack.packModuleId = 0;
    s_ptPack.packHead = 0;
    s_ptPack.packSecondId = 0;

    for(i = 0; i < 6; i++) {
        s_ptPack.arrData[i] = 0;
    }

    s_ptPack.checkSum = 0;

    s_iPackLen = 0;
    s_iGotPackId = 0;
    s_iRestByteNum = 0;
}

/*********************************************************************************************************
* 函数名称: PackData
* 函数功能:
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期:
* 注    意:
*********************************************************************************************************/
u8 PackData(StructPackType* pPT) {
    u8 valid = 0;

    if(pPT->packModuleId < 0x80) {
        valid = 1;
        PackWithCheckSum((u8*)pPT);
    }

    return (valid);
}

/*********************************************************************************************************
* 函数名称: UnPackData
* 函数功能:
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期:
* 注    意:
*********************************************************************************************************/
u8 UnPackData(u8 data) {
    u8 findPack = 0;
    u8* pBuf;

    pBuf = (u8*)&s_ptPack;

    if(s_iGotPackId) {
        if(0x80 <= data) {
            pBuf[s_iPackLen] = data;
            s_iPackLen++;
            s_iRestByteNum--;

            if(0 >= s_iRestByteNum && 10 == s_iPackLen) {
                findPack = UnpackWithCheckSum(pBuf);
                s_iGotPackId = 0;
            }
        }
        else {
            s_iGotPackId = 0;
        }
    }
    else if(data < 0x80) {
        s_iRestByteNum = 9;
        s_iPackLen = 1;
        s_ptPack.packModuleId = data;
        s_iGotPackId = 1;
    }
    return findPack;
}

/*********************************************************************************************************
* 函数名称: GetUnPackRs1t
* 函数功能:
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期:
* 注    意:
*********************************************************************************************************/
StructPackType GetUnPackRs1t(void) {
    return (s_ptPack);
}