/*********************************************************************************************************
* 模块名称: 
* 摘    要: 
* 当前版本: 
* 作    者: 
* 完成日期: 
* 内    容: 
* 注    意:                                                                  
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/
#ifndef _PACK_UNPACK_H_
#define _PACK_UNPACK_H_
/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
typedef struct {
    u8 packModuleId;    //模块包ID
    u8 packHead;        //数据头
    u8 packSecondId;    //二级ID
    u8 arrData[6];      //6个字节的数据
    u8 checkSum;        //校验核
}StructPackType;

typedef enum {
    //枚举定义，定义模块ID, 0x00-0x7F 不可重复
    MODULE_SYS = 0x01,      //系统信息

    MODULE_WAVE1 = 0x70,    //波形1信息
    MODULE_WAVE2 = 0x71,    //波形2信息

    MAX_MODULE_ID = 0x80
}EnumPackID;

typedef enum {
    DAT_RST = 0x01,     //系统需要的二级ID
    DAT_SYS_STS = 0x02,
    DAT_SELF_CHECK = 0x03,
    DAT_CMD_ACK = 0x04,

    CMD_RST_ACK = 0x80,
    CMD_GET_POST_RSLT = 0x81,
    CMD_PAT_TYPE = 0x90
}EnumSysSecondID;

//wave1模块的二级ID
typedef enum {
    DAT_WAVE1_WDATA = 0x02, //波形1的波形数据

    CMD_GEN_WAVE1 = 0x80    //生成波形1命令
}EnumWave1SecondID;

//wave2模块的二级ID
typedef enum {
    DAT_WAVE2_WDATA = 0x02, //波形2的波形数据

    CMD_GEN_WAVE2 = 0x80    //生成波形2命令
}EnumWave2SecondID;

/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void InitPackUnpack(void);
u8 PackData(StructPackType* pPT);
u8 UnPackData(u8 data);

StructPackType GetUnPackRs1t(void);
#endif // _PACK_UNPACK_H_