#include <stdio.h>
#include<math.h>

int getmax(int a,int b){
    return a>b?a:b;
};

int getmin(int a,int b){
    return a<b?a:b;
};


typedef struct
{
    char name[20];
    char color[20];
    char food[20];
}duck;

void bubble(int arr[]){
    for (int i = 0; i < 9; i++) {
        for (int j = 0; j < 9 - i; j++) {
            if (arr[j] > arr[j + 1]) {
                // 交换相邻的两个元素
                int temp = arr[j];
                arr[j] = arr[j + 1];
                arr[j + 1] = temp;
            }
        }
    }
}

double add(double a,double b){
    return a+b;
}

double remove1(double a,double b){
    return a-b;
}

double mul(double a,double b){
    return a*b;
}

double dev(double a,double b){
    return a/b;
}

double jue(double a){
    return a>0?a:-a;
}

int mo(int a,int b){
    return a%b;
}

int back(int arr[]){
    int maxn = arr[0];
    int maxptr=0;
    for(int i=1;i<10;i++){
        if(*(arr+i)>maxn){
            maxn = *(arr+1);
            maxptr = i;
        }
    }
    return maxptr;
}

void findMaxIndex(int* arr, int *maxIndex, int size) {
    int maxVal = *arr;
    *maxIndex = 0;
    
    for (int i = 1; i < size; i++) {
        if (arr[i] > maxVal) {
            maxVal = arr[i];
            *maxIndex = i;
        }
    }
}

typedef struct
{
    char kind[20];
    char color[20];
    char money[20];
}Litchi;


int main() {
/********** 基础&数组 **********/

/********** 1.请计算0X254D的二进制，八进制，十进制 **********/
    // int num = 0x254d;
    // printf("十进制表示：%d\n", num);
    // printf("八进制表示：%o\n", num);

/********** 2.打印 hello world **********/
    // printf("Hello World\n");

/********** 3.请用C语言printf一个圣诞树，注意方式有多种。 **********/
/********** Tips：可以直接eng输出；使用循环；copy and paste(but you need to figure out how it works) **********/
    // int num1 = 0;
    // scanf("%d", &num1);
    // int n = 0;
    // while (1) {
    //     if (num1 - (1+n)*n/2 <= 0) {
    //         break;
    //     }
    //     else {
    //         n++;
    //     }
    // }

    // for (int i = 0; i < n; i++) {
    //     if(num1 - (1+n)*n/2 < 0 && i==n-1){
    //         for(int y=0;y<num1-n*(n-1)/2;y++){
    //             printf("* ");
    //         }
    //         break;
    //     }
    //     for (int k = 0; k < n - i - 1; k++) {
    //         printf(" ");
    //     }
    //     for (int j = 0; j < i+1; j++) {
    //         printf("* ");
    //     }
    //     printf("\n");
    // }

/********** 4.综合2-3章所学，从键盘输入两数，输出两个之和 **********/
    //输出两数之和
    // int a, b;
    // scanf("%d %d", &a, &b);
    // printf("%d+%d=%d", a, b, a+b);

/********** 5.实现从键盘输入两个数，分别写函数并求两个数的最大值、最小值，并在屏幕上输出 **********/
    //求最大值最小值
    // int a,b;
    // scanf("%d %d",&a,&b);
    // int max1 = getmax(a,b);
    // int min1 = getmin(a,b);
    // printf("最大值：%d 最小值：%d\n", max1, min1);

/********** 7.使用for循环实现求1+2+3+...+100，并通过单步调试观察每一步的变化（通过F5设置断点，F10单步调试） **********/
    // 循环 1+2...
    // int c1=0;
    // for(int i =0;i<100;i++){
    //     c1+=i+1;
    // }
    // printf("%d\n",c1);

/********** 8.使用for循环实现100-1-2-3-4-5-...-20，，并通过单步调试观察每一步的变化（通过F5设置断点，F10单步调试） **********/
    // 循环 100-1-2-3...-20
    // int c2 = 100;
    // for(int i =1;i<21;i++){
    //     c2 -=i;
    // }
    // printf("%d\n",c2);

/********** 9.通过键盘输入10个整数，要求程序能够准确判断输入的整数个数10, **********/
/********** 并对输入的整数从小到大排序并输出到控制台窗口（不限制使用哪一种排序算法），要求使用数组 **********/
    // int arr[10];
    // for(int i =0;i<10;i++){
    //     scanf("%d",&arr[i]);
    // }
    // for (int i = 0; i < 9; i++) {
    //     for (int j = 0; j < 9 - i; j++) {
    //         if (arr[j] > arr[j + 1]) {
    //             // 交换相邻的两个元素
    //             int temp = arr[j];
    //             arr[j] = arr[j + 1];
    //             arr[j + 1] = temp;
    //         }
    //     }
    // }
    // for(int i = 0 ;i<10;i++){
    //     printf("%d ",arr[i]);
    // }
    // printf("\n");

/********** 10.用条件判断和逻辑运算编程，筛选2023-2500年中的闰年，并将结果列表输出 **********/
    // printf("闰年：");
    // for(int i =2023;i<2501;i++){
    //     if(i%4==0&&i%100!=0 || i%400==0){
    //         printf("%d ",i);
    //         printf("\n");
    //     }
    // }

/********** 多项式相加 **********/
//    double count = 0;
//    for(int i =0;i<11;i++){
//        if(i%2==0){
//            count+=1/pow(2,i);
//        }
//        if(i%2!=0){
//            count-=1/pow(2,i);
//        }
//    }
//    printf("%f",count);

/********** 函数&枚举 **********/
/********** 通过编写冒泡排序的函数，在main函数中调用，实现将输入的10个数字进行从小到大重新排序并输出 **********/
    // int arr[10];
    // for(int i =0;i<10;i++){
    //     scanf("%d",&arr[i]);
    // }
    // bubble(arr);
    // for(int i = 0 ;i<10;i++){
    //     printf("%d ",arr[i]);
    // }

/********** 定义 6个函数，分别实现加、减乘除取余绝对值。并通过调用上述函数，实现如下公式计算 **********/
//    1. 首先调用 `add(2023, 4.10)` 函数,将 2023 和 4.10 相加得到 2027.10。
//    2. 然后调用 `mul(2027.10, 3)` 函数,将 2027.10 乘以 3 得到 6081.30。
//    3. 接着调用 `dev(6081.30, 2)` 函数,将 6081.30 除以 2 得到 3040.65。
//    4. 然后调用 `mo(2023, 3)` 函数,将 2023 和 3 传入,得到一个结果。
//    5. 再调用 `remove1(结果)` 函数,移除这个结果的第一个元素。
//    6. 最后调用 `jue(结果)` 函数,处理移除第一个元素后的结果。
//    7. 将 `jue(remove1(mo(2023,3),dev(mul(add(2023,4.10),3),2)))` 的最终结果赋给变量 `y`。
//     double y = jue(remove1(mo(2023,3),dev(mul(add(2023,4.10),3),2)));
//     printf("%f",y);

/********** 3.编写一个函数，用值传递的方式，返回存储在int类型数组中最大值的下标 **********/
/********** （对数组元素的操作使用指针的形式来实现）。在main中调用该函数进行测试 **********/
     int arr[10];
     for(int i =0;i<10;i++){
         scanf("%d",&arr[i]);
     }
     int ptr = back(arr);
     printf("%d",ptr);

/********** 指针 **********/

/********************************************************************************
 * 1.编写一个函数，用地址传递的方式，
 * 将存储在int类型数组中最大值的下标写到地址指向的内存空间中（对数组元素的操作使用指针的形式来实现）。
 * 在main中调用该函数进行测试。对比4-5章的习题3，说一说在函数调用中，值传递和地址传递的区别。
 ********************************************************************************/
    // int arr[] = {5, 2, 8, 1, 9, 3};
    // int size = sizeof(arr) / sizeof(arr[0]);
    // int maxIndex;
    // findMaxIndex(arr, &maxIndex, size);
    // printf("最大下标： %d\n", maxIndex);

/********************************************************************************
 * 2.从键盘获取输入 6 个整数，存入数组 Arr。
 * 以指针访问形式求 Arr 内所有数据的总和、均值，并输出.
 ********************************************************************************/
    // int arr[6];
    // for(int i =0;i<6;i++){
    //     scanf("%d",arr[i]);
    // }
    // int all=0,mean=0;
    // for(int i =0 ;i<6;i++){
    //     all+=*(arr+i);
    // }
    // mean = all/6;
    // printf("均值：%d,总和：%d",mean,all);

/********************************************************************************
 * 3.接受用户从键盘输入 6个字符串数组，
 * 利用指针数组管理上述字符串数组并统计 6个字符串数组的字符个数总和。
 * 有余力的同学，可以进一步对上述6个字符串按从大到小做排序并输出。
 ********************************************************************************/
    // char srr[6][20];
    // char* temp[6];
    // for(int i =0;i<6;i++){
    //     scanf_s("%s",srr[i],10);
    //     temp[i]=srr[i];
    // }
    // int num =0;
    // for(int i =0;i<6;i++){
    //     num +=strlen(temp[i]);
    // }
    // printf("%d",num);

/********************************************************************************
 * 4.深大丽湖内有 6 只可达鸭，有名字(字符串类型)、颜色(字符串类型)、
 * 喜欢吃的食物名字(字符串类型)。用指针数组管理每只可达鸭的上述信息。
 ********************************************************************************/
    // duck* ducks[6];
    // for (int i = 0; i < 6; i++) {
    //     ducks[i] = malloc(sizeof(duck));
    //     sprintf(ducks[i]->name, "Duck%d", i+1);
    //     sprintf(ducks[i]->color, "Color%d", i+1);
    //     sprintf(ducks[i]->food, "Food%d", i+1);
    // }
    // for (int i = 0; i < 6; i++) {
    //     printf("名字: %s, 颜色: %s, 最喜欢的食物: %s\n",
    //            ducks[i]->name, ducks[i]->color, ducks[i]->food);
    // }

/********** 结构体&结构体指针 **********/
/********************************************************************************
 * 1.假设要编写一个与结构相关的函数，是用结构体指针作为参数，还是用结构体作为参数和返回值？
 * 两者各有什么优缺点？上网找到使用结构体作为函数参数和返回值的示例代码，
 * 并将其改写为使用结构体指针作为函数参数的写法，反之也可；
 ********************************************************************************/
    // Litchi l[6];
    // for(int i=0;i<6;i++){
    //     sprintf(l[i].kind,"kind%d",i+1);
    //     sprintf(l[i].color,"color%d",i+1);
    //     sprintf(l[i].money,"money%d",i+1);
    // }
    // for (int i = 0; i < 6; i++) {
    //     printf("种类: %s, 颜色: %s, 价钱: %s\n",
    //            l[i].kind, l[i].color, l[i].money);
    // }
/********************************************************************************
 * 1.假设要编写一个与结构相关的函数，是用结构体指针作为参数，
 * 还是用结构体作为参数和返回值？两者各有什么优缺点？
 * 上网找到使用结构体作为函数参数和返回值的示例代码，
 * 并将其改写为使用结构体指针作为函数参数的写法，反之也可；
 ********************************************************************************/

/********************************************************************************
 * 2.定义荔枝结构体(Litchi) .包括种类(如桂味、糯米、荔枝王、淮枝等)、
 * 颜色、核肉大小比、甜度、单价、成熟月份、产地等等信息。
 * 创建荔枝结构体数组，包括至少 3 个品种的共 6 颗荔枝。
 * 用结构体成员符号(.)的形式，访问输出 6 颗荔枝的详细信息。
 ********************************************************************************/

/********************************************************************************
 * 3.基于 Task 1，用结构体指针 (->)的形式访问荔枝结构体数组，
 * 根据每颗荔枝的价格按从高到低排序输出各荔枝的信息。有余力的同学建议用函数实现排序。
 ********************************************************************************/

/********************************************************************************
 * 4.深大丽湖内有 10 只可达鸭，有名字(字符串类型)、
 * 体重、年龄、颜色(字符串类型)、喜欢吃的食物名字(字符串类型)。
 * 创建结构体数组管理上述 10 只可达鸭，用结构体指针访问该数组，
 * 根据用户输入的喜欢的可达鸭颜色，输出满足该颜色的可达鸭的信息。
 ********************************************************************************/
    return 0;
}