/*********************************************************************************************************
* 模块名称: PackUnpack.h
* 摘    要: PCT协议的打包解包模块
* 当前版本: 1.0.0
* 作    者: Leyutek(COPYRIGHT 2018 - 2021 Leyutek. All rights reserved.)
* 完成日期: 2021年03月01日 
* 内    容:
* 注    意: none                                                                  
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容: 
* 修改文件:  
*********************************************************************************************************/
#ifndef _PACK_UNPACK_H_
#define _PACK_UNPACK_H_

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "DataType.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/
//包类型结构体
typedef struct
{
  u8 packModuleId;    //模块包ID
  u8 packHead;        //数据头
  u8 packSecondId;    //二级ID
  u8 arrData[6];      //包数据
  u8 checkSum;        //校验和
}StructPackType;

//枚举定义，定义模块ID，0x00-0x7F，不可以重复
typedef enum
{
  MODULE_SYS     = 0x01,          //系统信息

  MODULE_WAVE1   = 0x70,          //波形1信息
  MODULE_WAVE2   = 0x71,          //波形2信息

  MAX_MODULE_ID  = 0x80
}EnumPackID;

//定义二级ID，0x00-0xFF，因为是分属于不同的模块ID，因此不同模块ID的二级ID可以重复
//系统模块的二级ID
typedef enum 
{
  DAT_RST         = 0x01,         //系统复位信息
  DAT_SYS_STS     = 0x02,         //系统状态
  DAT_SELF_CHECK  = 0x03,         //系统自检结果
  DAT_CMD_ACK     = 0x04,         //命令应答
  
  CMD_RST_ACK     = 0x80,         //模块复位信息应答
  CMD_GET_POST_RSLT = 0x81,       //读取自检结果
  CMD_PAT_TYPE    = 0x90,         //病人类型设置  
}EnumSysSecondID;

//wave1模块的二级ID
typedef enum 
{   
  DAT_WAVE1_WDATA = 0x02,         //波形1的波形数据 
  
  CMD_GEN_WAVE1   = 0x80,         //生成波形1命令
}EnumWave1SecondID;

//wave2模块的二级ID
typedef enum 
{
  DAT_WAVE2_WDATA = 0x02,         //波形2的波形数据
                         
  CMD_GEN_WAVE2   = 0x80,         //生成波形2命令
}EnumWave2SecondID;
  
/*********************************************************************************************************
*                                              API函数声明
*********************************************************************************************************/
void  InitPackUnpack(void);               //初始化打包解包模块
u8    PackData(StructPackType* pPT);      //对数据进行打包，1-打包成功，0-打包失败
u8    UnPackData(u8 data);                //对数据进行解包，1-解包成功，0-解包失败

StructPackType  GetUnPackRslt(void);      //读取解包后数据包

#endif
