/*********************************************************************************************************
* 模块名称: 
* 摘    要: 
* 当前版本: 
* 作    者: 
* 完成日期:  
* 内    容:
* 注    意:                                                                   
**********************************************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <windows.h>

#include "ProcHostCmd.h"
#include "PackUnpack.h"
#include "SendDataToHost.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
static unsigned int s_iTimerWave1Id;
static unsigned int s_iTimerWave2Id;

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
static void __stdcall TimerISRForWave1(UINT uTimerID, UINT uMsg, DWORD_PTR dwUser,
                                       DWORD_PTR dw1, DWORD_PTR dw2);
static void __stdcall TimerISRForWave2(UINT uTimerID, UINT uMsg, DWORD_PTR dwUser,
                                       DWORD_PTR dw1, DWORD_PTR dw2);
static u8 OnGenWave1(u8* pMsg);
static u8 OnGenWave2(u8* pMsg);
/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: 
* 函数功能:  
* 输入参数: 
* 输出参数: 
* 返 回 值: 
* 创建日期: 
* 注    意:
*********************************************************************************************************/
static void __stdcall TimerISRForWave1(UINT uTimerID, UINT uMsg, DWORD_PTR dwUser,
                                       DWORD_PTR dw1, DWORD_PTR dw2) {
    u8 arrWave1Data[5] = {0x11, 0x11, 0x11, 0x11, 0x11};
    SendWave1ToHost(arrWave1Data);
    printf("\n");
}

/*********************************************************************************************************
* 函数名称:
* 函数功能:
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期:
* 注    意:
*********************************************************************************************************/
static void __stdcall TimerISRForWave2(UINT uTimerID, UINT uMsg, DWORD_PTR dwUser,
                                       DWORD_PTR dw1, DWORD_PTR dw2) {
    u8 arrWave2Data[5] = {0x22, 0x22, 0x22, 0x22, 0x22};
    SendWave2ToHost(arrWave2Data);
    printf("\n");
}

/*********************************************************************************************************
* 函数名称:
* 函数功能:
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期:
* 注    意:
*********************************************************************************************************/
static u8 OnGenWave1(u8* pMsg) {
    s_iTimerWave1Id = timeSetEvent(200, 1, TimerISRForWave1, pMsg[0], TIME_PERIODIC);
    timeKillEvent(s_iTimerWave2Id);
    return (CMD_ACK_OK);
}

/*********************************************************************************************************
* 函数名称:
* 函数功能:
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期:
* 注    意:
*********************************************************************************************************/
static u8 OnGenWave2(u8* pMsg) {
    s_iTimerWave2Id = timeSetEvent(200, 1, TimerISRForWave2, pMsg[0], TIME_PERIODIC);
    timeKillEvent(s_iTimerWave1Id);
    return (CMD_ACK_OK);
}

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: 
* 函数功能:  
* 输入参数: 
* 输出参数: 
* 返 回 值: 
* 创建日期: 
* 注    意:
*********************************************************************************************************/
void InitProcHostCmd(void) {
    
}

/*********************************************************************************************************
* 函数名称:
* 函数功能:
* 输入参数:
* 输出参数:
* 返 回 值:
* 创建日期:
* 注    意:
*********************************************************************************************************/
void ProcHostCmd(u8 recData) {
    u8 ack;
    StructPackType pack;
    
    while(UnPackData(recData)){
        pack = GetUnPackRslt();
        switch (pack.packModuleId) {
            case MODULE_WAVE1:
                if(CMD_GEN_WAVE1 == pack.packSecondId) {
                    ack = OnGenWave1(pack.arrData);
                    printf("GEN_WAVE1 ACK:\n");
                    SendAckPack(MODULE_WAVE1, CMD_GEN_WAVE1, ack);
                    printf("\n");
                    printf("------WAVE1------\n");
                }
                break;
            case MODULE_WAVE2:
                if(CMD_GEN_WAVE2 == pack.packSecondId) {
                    ack = OnGenWave2(pack.arrData);
                    printf("GEN_WAVE2 ACK:\n");
                    SendAckPack(MODULE_WAVE2, CMD_GEN_WAVE2, ack);
                    printf("\n");
                    printf("------WAVE2------\n");
                }
                break;
            default:
                timeKillEvent(s_iTimerWave1Id);
                timeKillEvent(s_iTimerWave2Id);
                break;
        }
    }
}